Revit 2025 API
WallpaintFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "WallpaintFinish" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WallpaintFinishType
Public Enumeration WallpaintFinishType
public enum class WallpaintFinishType
type WallpaintFinishType
Members
Member name | Value | Description
Flat | 0
Eggshell | 1
Platinum | 2
Pearl | 3
Semigloss | 4
Gloss | 5
See Also
Reference
Autodesk.Revit.DB.Visual Namespace